Model: "model"
__________________________________________________________________________________________________
 Layer (type)                Output Shape                 Param #   Connected to                  
==================================================================================================
 input_1 (InputLayer)        [(None, 224, 224, 3)]        0         []                            
                                                                                                  
 conv1_pad (ZeroPadding2D)   (None, 225, 225, 3)          0         ['input_1[0][0]']             
                                                                                                  
 conv1 (Conv2D)              (None, 112, 112, 32)         864       ['conv1_pad[0][0]']           
                                                                                                  
 conv1_bn (BatchNormalizati  (None, 112, 112, 32)         128       ['conv1[0][0]']               
 on)                                                                                              
                                                                                                  
 conv1_relu (ReLU)           (None, 112, 112, 32)         0         ['conv1_bn[0][0]']            
                                                                                                  
 conv_dw_1 (DepthwiseConv2D  (None, 112, 112, 32)         288       ['conv1_relu[0][0]']          
 )                                                                                                
                                                                                                  
 conv_dw_1_bn (BatchNormali  (None, 112, 112, 32)         128       ['conv_dw_1[0][0]']           
 zation)                                                                                          
                                                                                                  
 conv_dw_1_relu (ReLU)       (None, 112, 112, 32)         0         ['conv_dw_1_bn[0][0]']        
                                                                                                  
 conv_pw_1 (Conv2D)          (None, 112, 112, 64)         2048      ['conv_dw_1_relu[0][0]']      
                                                                                                  
 conv_pw_1_bn (BatchNormali  (None, 112, 112, 64)         256       ['conv_pw_1[0][0]']           
 zation)                                                                                          
                                                                                                  
 conv_pw_1_relu (ReLU)       (None, 112, 112, 64)         0         ['conv_pw_1_bn[0][0]']        
                                                                                                  
 conv_pad_2 (ZeroPadding2D)  (None, 113, 113, 64)         0         ['conv_pw_1_relu[0][0]']      
                                                                                                  
 conv_dw_2 (DepthwiseConv2D  (None, 56, 56, 64)           576       ['conv_pad_2[0][0]']          
 )                                                                                                
                                                                                                  
 conv_dw_2_bn (BatchNormali  (None, 56, 56, 64)           256       ['conv_dw_2[0][0]']           
 zation)                                                                                          
                                                                                                  
 conv_dw_2_relu (ReLU)       (None, 56, 56, 64)           0         ['conv_dw_2_bn[0][0]']        
                                                                                                  
 conv_pw_2 (Conv2D)          (None, 56, 56, 128)          8192      ['conv_dw_2_relu[0][0]']      
                                                                                                  
 conv_pw_2_bn (BatchNormali  (None, 56, 56, 128)          512       ['conv_pw_2[0][0]']           
 zation)                                                                                          
                                                                                                  
 conv_pw_2_relu (ReLU)       (None, 56, 56, 128)          0         ['conv_pw_2_bn[0][0]']        
                                                                                                  
 conv_dw_3 (DepthwiseConv2D  (None, 56, 56, 128)          1152      ['conv_pw_2_relu[0][0]']      
 )                                                                                                
                                                                                                  
 conv_dw_3_bn (BatchNormali  (None, 56, 56, 128)          512       ['conv_dw_3[0][0]']           
 zation)                                                                                          
                                                                                                  
 conv_dw_3_relu (ReLU)       (None, 56, 56, 128)          0         ['conv_dw_3_bn[0][0]']        
                                                                                                  
 conv_pw_3 (Conv2D)          (None, 56, 56, 128)          16384     ['conv_dw_3_relu[0][0]']      
                                                                                                  
 conv_pw_3_bn (BatchNormali  (None, 56, 56, 128)          512       ['conv_pw_3[0][0]']           
 zation)                                                                                          
                                                                                                  
 conv_pw_3_relu (ReLU)       (None, 56, 56, 128)          0         ['conv_pw_3_bn[0][0]']        
                                                                                                  
 conv_pad_4 (ZeroPadding2D)  (None, 57, 57, 128)          0         ['conv_pw_3_relu[0][0]']      
                                                                                                  
 conv_dw_4 (DepthwiseConv2D  (None, 28, 28, 128)          1152      ['conv_pad_4[0][0]']          
 )                                                                                                
                                                                                                  
 conv_dw_4_bn (BatchNormali  (None, 28, 28, 128)          512       ['conv_dw_4[0][0]']           
 zation)                                                                                          
                                                                                                  
 conv_dw_4_relu (ReLU)       (None, 28, 28, 128)          0         ['conv_dw_4_bn[0][0]']        
                                                                                                  
 conv_pw_4 (Conv2D)          (None, 28, 28, 256)          32768     ['conv_dw_4_relu[0][0]']      
                                                                                                  
 conv_pw_4_bn (BatchNormali  (None, 28, 28, 256)          1024      ['conv_pw_4[0][0]']           
 zation)                                                                                          
                                                                                                  
 conv_pw_4_relu (ReLU)       (None, 28, 28, 256)          0         ['conv_pw_4_bn[0][0]']        
                                                                                                  
 conv_dw_5 (DepthwiseConv2D  (None, 28, 28, 256)          2304      ['conv_pw_4_relu[0][0]']      
 )                                                                                                
                                                                                                  
 conv_dw_5_bn (BatchNormali  (None, 28, 28, 256)          1024      ['conv_dw_5[0][0]']           
 zation)                                                                                          
                                                                                                  
 conv_dw_5_relu (ReLU)       (None, 28, 28, 256)          0         ['conv_dw_5_bn[0][0]']        
                                                                                                  
 conv_pw_5 (Conv2D)          (None, 28, 28, 256)          65536     ['conv_dw_5_relu[0][0]']      
                                                                                                  
 conv_pw_5_bn (BatchNormali  (None, 28, 28, 256)          1024      ['conv_pw_5[0][0]']           
 zation)                                                                                          
                                                                                                  
 conv_pw_5_relu (ReLU)       (None, 28, 28, 256)          0         ['conv_pw_5_bn[0][0]']        
                                                                                                  
 conv_pad_6 (ZeroPadding2D)  (None, 29, 29, 256)          0         ['conv_pw_5_relu[0][0]']      
                                                                                                  
 conv_dw_6 (DepthwiseConv2D  (None, 14, 14, 256)          2304      ['conv_pad_6[0][0]']          
 )                                                                                                
                                                                                                  
 conv_dw_6_bn (BatchNormali  (None, 14, 14, 256)          1024      ['conv_dw_6[0][0]']           
 zation)                                                                                          
                                                                                                  
 conv_dw_6_relu (ReLU)       (None, 14, 14, 256)          0         ['conv_dw_6_bn[0][0]']        
                                                                                                  
 conv_pw_6 (Conv2D)          (None, 14, 14, 512)          131072    ['conv_dw_6_relu[0][0]']      
                                                                                                  
 conv_pw_6_bn (BatchNormali  (None, 14, 14, 512)          2048      ['conv_pw_6[0][0]']           
 zation)                                                                                          
                                                                                                  
 conv_pw_6_relu (ReLU)       (None, 14, 14, 512)          0         ['conv_pw_6_bn[0][0]']        
                                                                                                  
 conv_dw_7 (DepthwiseConv2D  (None, 14, 14, 512)          4608      ['conv_pw_6_relu[0][0]']      
 )                                                                                                
                                                                                                  
 conv_dw_7_bn (BatchNormali  (None, 14, 14, 512)          2048      ['conv_dw_7[0][0]']           
 zation)                                                                                          
                                                                                                  
 conv_dw_7_relu (ReLU)       (None, 14, 14, 512)          0         ['conv_dw_7_bn[0][0]']        
                                                                                                  
 conv_pw_7 (Conv2D)          (None, 14, 14, 512)          262144    ['conv_dw_7_relu[0][0]']      
                                                                                                  
 conv_pw_7_bn (BatchNormali  (None, 14, 14, 512)          2048      ['conv_pw_7[0][0]']           
 zation)                                                                                          
                                                                                                  
 conv_pw_7_relu (ReLU)       (None, 14, 14, 512)          0         ['conv_pw_7_bn[0][0]']        
                                                                                                  
 conv_dw_8 (DepthwiseConv2D  (None, 14, 14, 512)          4608      ['conv_pw_7_relu[0][0]']      
 )                                                                                                
                                                                                                  
 conv_dw_8_bn (BatchNormali  (None, 14, 14, 512)          2048      ['conv_dw_8[0][0]']           
 zation)                                                                                          
                                                                                                  
 conv_dw_8_relu (ReLU)       (None, 14, 14, 512)          0         ['conv_dw_8_bn[0][0]']        
                                                                                                  
 conv_pw_8 (Conv2D)          (None, 14, 14, 512)          262144    ['conv_dw_8_relu[0][0]']      
                                                                                                  
 conv_pw_8_bn (BatchNormali  (None, 14, 14, 512)          2048      ['conv_pw_8[0][0]']           
 zation)                                                                                          
                                                                                                  
 conv_pw_8_relu (ReLU)       (None, 14, 14, 512)          0         ['conv_pw_8_bn[0][0]']        
                                                                                                  
 conv_dw_9 (DepthwiseConv2D  (None, 14, 14, 512)          4608      ['conv_pw_8_relu[0][0]']      
 )                                                                                                
                                                                                                  
 conv_dw_9_bn (BatchNormali  (None, 14, 14, 512)          2048      ['conv_dw_9[0][0]']           
 zation)                                                                                          
                                                                                                  
 conv_dw_9_relu (ReLU)       (None, 14, 14, 512)          0         ['conv_dw_9_bn[0][0]']        
                                                                                                  
 conv_pw_9 (Conv2D)          (None, 14, 14, 512)          262144    ['conv_dw_9_relu[0][0]']      
                                                                                                  
 conv_pw_9_bn (BatchNormali  (None, 14, 14, 512)          2048      ['conv_pw_9[0][0]']           
 zation)                                                                                          
                                                                                                  
 conv_pw_9_relu (ReLU)       (None, 14, 14, 512)          0         ['conv_pw_9_bn[0][0]']        
                                                                                                  
 conv_dw_10 (DepthwiseConv2  (None, 14, 14, 512)          4608      ['conv_pw_9_relu[0][0]']      
 D)                                                                                               
                                                                                                  
 conv_dw_10_bn (BatchNormal  (None, 14, 14, 512)          2048      ['conv_dw_10[0][0]']          
 ization)                                                                                         
                                                                                                  
 conv_dw_10_relu (ReLU)      (None, 14, 14, 512)          0         ['conv_dw_10_bn[0][0]']       
                                                                                                  
 conv_pw_10 (Conv2D)         (None, 14, 14, 512)          262144    ['conv_dw_10_relu[0][0]']     
                                                                                                  
 conv_pw_10_bn (BatchNormal  (None, 14, 14, 512)          2048      ['conv_pw_10[0][0]']          
 ization)                                                                                         
                                                                                                  
 conv_pw_10_relu (ReLU)      (None, 14, 14, 512)          0         ['conv_pw_10_bn[0][0]']       
                                                                                                  
 conv_dw_11 (DepthwiseConv2  (None, 14, 14, 512)          4608      ['conv_pw_10_relu[0][0]']     
 D)                                                                                               
                                                                                                  
 conv_dw_11_bn (BatchNormal  (None, 14, 14, 512)          2048      ['conv_dw_11[0][0]']          
 ization)                                                                                         
                                                                                                  
 conv_dw_11_relu (ReLU)      (None, 14, 14, 512)          0         ['conv_dw_11_bn[0][0]']       
                                                                                                  
 conv_pw_11 (Conv2D)         (None, 14, 14, 512)          262144    ['conv_dw_11_relu[0][0]']     
                                                                                                  
 conv_pw_11_bn (BatchNormal  (None, 14, 14, 512)          2048      ['conv_pw_11[0][0]']          
 ization)                                                                                         
                                                                                                  
 conv_pw_11_relu (ReLU)      (None, 14, 14, 512)          0         ['conv_pw_11_bn[0][0]']       
                                                                                                  
 conv_pad_12 (ZeroPadding2D  (None, 15, 15, 512)          0         ['conv_pw_11_relu[0][0]']     
 )                                                                                                
                                                                                                  
 conv_dw_12 (DepthwiseConv2  (None, 7, 7, 512)            4608      ['conv_pad_12[0][0]']         
 D)                                                                                               
                                                                                                  
 conv_dw_12_bn (BatchNormal  (None, 7, 7, 512)            2048      ['conv_dw_12[0][0]']          
 ization)                                                                                         
                                                                                                  
 conv_dw_12_relu (ReLU)      (None, 7, 7, 512)            0         ['conv_dw_12_bn[0][0]']       
                                                                                                  
 conv_pw_12 (Conv2D)         (None, 7, 7, 1024)           524288    ['conv_dw_12_relu[0][0]']     
                                                                                                  
 conv_pw_12_bn (BatchNormal  (None, 7, 7, 1024)           4096      ['conv_pw_12[0][0]']          
 ization)                                                                                         
                                                                                                  
 conv_pw_12_relu (ReLU)      (None, 7, 7, 1024)           0         ['conv_pw_12_bn[0][0]']       
                                                                                                  
 conv_dw_13 (DepthwiseConv2  (None, 7, 7, 1024)           9216      ['conv_pw_12_relu[0][0]']     
 D)                                                                                               
                                                                                                  
 conv_dw_13_bn (BatchNormal  (None, 7, 7, 1024)           4096      ['conv_dw_13[0][0]']          
 ization)                                                                                         
                                                                                                  
 conv_dw_13_relu (ReLU)      (None, 7, 7, 1024)           0         ['conv_dw_13_bn[0][0]']       
                                                                                                  
 conv_pw_13 (Conv2D)         (None, 7, 7, 1024)           1048576   ['conv_dw_13_relu[0][0]']     
                                                                                                  
 conv_pw_13_bn (BatchNormal  (None, 7, 7, 1024)           4096      ['conv_pw_13[0][0]']          
 ization)                                                                                         
                                                                                                  
 conv_pw_13_relu (ReLU)      (None, 7, 7, 1024)           0         ['conv_pw_13_bn[0][0]']       
                                                                                                  
 decoder_stage0_upsampling   (None, 14, 14, 1024)         0         ['conv_pw_13_relu[0][0]']     
 (UpSampling2D)                                                                                   
                                                                                                  
 decoder_stage0_concat (Con  (None, 14, 14, 1536)         0         ['decoder_stage0_upsampling[0]
 catenate)                                                          [0]',                         
                                                                     'conv_pw_11_relu[0][0]']     
                                                                                                  
 decoder_stage0a_conv (Conv  (None, 14, 14, 1024)         1415577   ['decoder_stage0_concat[0][0]'
 2D)                                                      6         ]                             
                                                                                                  
 decoder_stage0a_bn (BatchN  (None, 14, 14, 1024)         4096      ['decoder_stage0a_conv[0][0]']
 ormalization)                                                                                    
                                                                                                  
 decoder_stage0a_relu (Acti  (None, 14, 14, 1024)         0         ['decoder_stage0a_bn[0][0]']  
 vation)                                                                                          
                                                                                                  
 decoder_stage0b_conv (Conv  (None, 14, 14, 1024)         9437184   ['decoder_stage0a_relu[0][0]']
 2D)                                                                                              
                                                                                                  
 decoder_stage0b_bn (BatchN  (None, 14, 14, 1024)         4096      ['decoder_stage0b_conv[0][0]']
 ormalization)                                                                                    
                                                                                                  
 decoder_stage0b_relu (Acti  (None, 14, 14, 1024)         0         ['decoder_stage0b_bn[0][0]']  
 vation)                                                                                          
                                                                                                  
 decoder_stage1_upsampling   (None, 28, 28, 1024)         0         ['decoder_stage0b_relu[0][0]']
 (UpSampling2D)                                                                                   
                                                                                                  
 decoder_stage1_concat (Con  (None, 28, 28, 1280)         0         ['decoder_stage1_upsampling[0]
 catenate)                                                          [0]',                         
                                                                     'conv_pw_5_relu[0][0]']      
                                                                                                  
 decoder_stage1a_conv (Conv  (None, 28, 28, 512)          5898240   ['decoder_stage1_concat[0][0]'
 2D)                                                                ]                             
                                                                                                  
 decoder_stage1a_bn (BatchN  (None, 28, 28, 512)          2048      ['decoder_stage1a_conv[0][0]']
 ormalization)                                                                                    
                                                                                                  
 decoder_stage1a_relu (Acti  (None, 28, 28, 512)          0         ['decoder_stage1a_bn[0][0]']  
 vation)                                                                                          
                                                                                                  
 decoder_stage1b_conv (Conv  (None, 28, 28, 512)          2359296   ['decoder_stage1a_relu[0][0]']
 2D)                                                                                              
                                                                                                  
 decoder_stage1b_bn (BatchN  (None, 28, 28, 512)          2048      ['decoder_stage1b_conv[0][0]']
 ormalization)                                                                                    
                                                                                                  
 decoder_stage1b_relu (Acti  (None, 28, 28, 512)          0         ['decoder_stage1b_bn[0][0]']  
 vation)                                                                                          
                                                                                                  
 decoder_stage2_upsampling   (None, 56, 56, 512)          0         ['decoder_stage1b_relu[0][0]']
 (UpSampling2D)                                                                                   
                                                                                                  
 decoder_stage2_concat (Con  (None, 56, 56, 640)          0         ['decoder_stage2_upsampling[0]
 catenate)                                                          [0]',                         
                                                                     'conv_pw_3_relu[0][0]']      
                                                                                                  
 decoder_stage2a_conv (Conv  (None, 56, 56, 256)          1474560   ['decoder_stage2_concat[0][0]'
 2D)                                                                ]                             
                                                                                                  
 decoder_stage2a_bn (BatchN  (None, 56, 56, 256)          1024      ['decoder_stage2a_conv[0][0]']
 ormalization)                                                                                    
                                                                                                  
 decoder_stage2a_relu (Acti  (None, 56, 56, 256)          0         ['decoder_stage2a_bn[0][0]']  
 vation)                                                                                          
                                                                                                  
 decoder_stage2b_conv (Conv  (None, 56, 56, 256)          589824    ['decoder_stage2a_relu[0][0]']
 2D)                                                                                              
                                                                                                  
 decoder_stage2b_bn (BatchN  (None, 56, 56, 256)          1024      ['decoder_stage2b_conv[0][0]']
 ormalization)                                                                                    
                                                                                                  
 decoder_stage2b_relu (Acti  (None, 56, 56, 256)          0         ['decoder_stage2b_bn[0][0]']  
 vation)                                                                                          
                                                                                                  
 decoder_stage3_upsampling   (None, 112, 112, 256)        0         ['decoder_stage2b_relu[0][0]']
 (UpSampling2D)                                                                                   
                                                                                                  
 decoder_stage3_concat (Con  (None, 112, 112, 320)        0         ['decoder_stage3_upsampling[0]
 catenate)                                                          [0]',                         
                                                                     'conv_pw_1_relu[0][0]']      
                                                                                                  
 decoder_stage3a_conv (Conv  (None, 112, 112, 128)        368640    ['decoder_stage3_concat[0][0]'
 2D)                                                                ]                             
                                                                                                  
 decoder_stage3a_bn (BatchN  (None, 112, 112, 128)        512       ['decoder_stage3a_conv[0][0]']
 ormalization)                                                                                    
                                                                                                  
 decoder_stage3a_relu (Acti  (None, 112, 112, 128)        0         ['decoder_stage3a_bn[0][0]']  
 vation)                                                                                          
                                                                                                  
 decoder_stage3b_conv (Conv  (None, 112, 112, 128)        147456    ['decoder_stage3a_relu[0][0]']
 2D)                                                                                              
                                                                                                  
 decoder_stage3b_bn (BatchN  (None, 112, 112, 128)        512       ['decoder_stage3b_conv[0][0]']
 ormalization)                                                                                    
                                                                                                  
 decoder_stage3b_relu (Acti  (None, 112, 112, 128)        0         ['decoder_stage3b_bn[0][0]']  
 vation)                                                                                          
                                                                                                  
 decoder_stage4_upsampling   (None, 224, 224, 128)        0         ['decoder_stage3b_relu[0][0]']
 (UpSampling2D)                                                                                   
                                                                                                  
 decoder_stage4a_conv (Conv  (None, 224, 224, 64)         73728     ['decoder_stage4_upsampling[0]
 2D)                                                                [0]']                         
                                                                                                  
 decoder_stage4a_bn (BatchN  (None, 224, 224, 64)         256       ['decoder_stage4a_conv[0][0]']
 ormalization)                                                                                    
                                                                                                  
 decoder_stage4a_relu (Acti  (None, 224, 224, 64)         0         ['decoder_stage4a_bn[0][0]']  
 vation)                                                                                          
                                                                                                  
 decoder_stage4b_conv (Conv  (None, 224, 224, 64)         36864     ['decoder_stage4a_relu[0][0]']
 2D)                                                                                              
                                                                                                  
 decoder_stage4b_bn (BatchN  (None, 224, 224, 64)         256       ['decoder_stage4b_conv[0][0]']
 ormalization)                                                                                    
                                                                                                  
 decoder_stage4b_relu (Acti  (None, 224, 224, 64)         0         ['decoder_stage4b_bn[0][0]']  
 vation)                                                                                          
                                                                                                  
 final_conv (Conv2D)         (None, 224, 224, 1)          577       ['decoder_stage4b_relu[0][0]']
                                                                                                  
 sigmoid (Activation)        (None, 224, 224, 1)          0         ['final_conv[0][0]']          
                                                                                                  
==================================================================================================
Total params: 37786881 (144.15 MB)
Trainable params: 37757057 (144.03 MB)
Non-trainable params: 29824 (116.50 KB)
__________________________________________________________________________________________________
